In [1]:
import pandas as pd
import streamlit as st
import numpy as np
import plotly.express as px
import folium
from streamlit_folium import folium_static
from folium.plugins import MarkerCluster

In [16]:
def readData(df):
    data = pd.read_csv(df)
    data['date'] = pd.to_datetime(data['date'])
    data['bathrooms'] = np.int64(round(data['bathrooms']-0.3))
    data['floors'] = np.int64(round(data['floors']-0.3))
    data['waterfront'] = data['waterfront'].apply(lambda x: 'SIM' if x == 1 else 'NÃO')
    data['age'] = np.int64(np.int64(pd.to_datetime(data['date']).dt.strftime('%Y')) - data['yr_built'])
    data.drop(columns=['sqft_lot', 'sqft_above', 'sqft_basement', 'yr_renovated', 'sqft_living15', 'sqft_lot15'], axis=1, inplace=True)

    return data
dataframe = readData('https://raw.githubusercontent.com/HedvaldoCosta/DataScience/main/KcHouse/Datasets/kc_house_data.csv')

In [17]:
dataframe

,id,date,price,bedrooms,bathrooms,sqft_living,floors,waterfront,view,condition,grade,yr_built,zipcode,lat,long,age
0,7129300520,2014-10-13,221900.0,3,1,1180,1,NÃO,0,3,7,1955,98178,47.5112,-122.257,59
1,6414100192,2014-12-09,538000.0,3,2,2570,2,NÃO,0,3,7,1951,98125,47.7210,-122.319,63
2,5631500400,2015-02-25,180000.0,2,1,770,1,NÃO,0,3,6,1933,98028,47.7379,-122.233,82
3,2487200875,2014-12-09,604000.0,4,3,1960,1,NÃO,0,5,7,1965,98136,47.5208,-122.393,49
4,1954400510,2015-02-18,510000.0,3,2,1680,1,NÃO,0,3,8,1987,98074,47.6168,-122.045,28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21608,263000018,2014-05-21,360000.0,3,2,1530,3,NÃO,0,3,8,2009,98103,47.6993,-122.346,5
21609,6600060120,2015-02-23,400000.0,4,2,2310,2,NÃO,0,3,8,2014,98146,47.5107,-122.362,1
21610,1523300141,2014-06-23,402101.0,2,0,1020,2,NÃO,0,3,7,2009,98144,47.5944,-122.299,5
21611,291310100,2015-01-16,400000.0,3,2,1600,2,NÃO,0,3,8,2004,98027,47.5345,-122.069,11
21612,1523300157,2014-10-15,325000.0,2,0,1020,2,NÃO,0,3,7,2008,98144,47.5941,-122.299,6

In [28]:
mapa = folium.Map(location=[dataframe['lat'].mean(), dataframe['long'].mean()])
marker_cluster = MarkerCluster().add_to(mapa)
data_map = dataframe[['id', 'price', 'bedrooms', 'bathrooms', 'floors']].copy()

               id     price  bedrooms  bathrooms  floors
0      7129300520  221900.0         3          1       1
1      6414100192  538000.0         3          2       2
2      5631500400  180000.0         2          1       1
3      2487200875  604000.0         4          3       1
4      1954400510  510000.0         3          2       1
...           ...       ...       ...        ...     ...
21608   263000018  360000.0         3          2       3
21609  6600060120  400000.0         4          2       2
21610  1523300141  402101.0         2          0       2
21611   291310100  400000.0         3          2       2
21612  1523300157  325000.0         2          0       2

[21613 rows x 5 columns]